Tekla Open API Reference for Tekla Structures 2025
LoadArea.Position2 Property
 The second position point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Position2 { get; set; }
Public Property Position2 As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
LoadArea Class
Tekla.Structures.Model Namespace